404Zen/STM32H7_Arm2D/Code/app/App/Drivers/io_i2c.c
/**
 * @file io_i2c.c
 * @brief Brief description of the source file
 * @author 404zen
 * @date 2026-02-10
 * @version 1.0
 */

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "io_i2c.h"

//Platform
#include "main.h"
#include "stm32h7xx_hal.h"
#include "stm32h7xx_hal_gpio.h"


static io_i2c_platform_t platform_ops;

struct io_i2c_instance_t touch_i2c;
static struct io_i2c_instance_t *loop_list = NULL;

void test_callback(uint8_t event);

static int io_i2c_time_exceed(uint32_t *start_time, uint32_t *time_out);
static int io_i2c_state_machine(struct io_i2c_instance_t *instance);

void io_i2c_init(void)
{
    /* Platform init */
    platform_ops.io_i2c_pin_write = io_i2c_write;
    platform_ops.io_i2c_pin_read = io_i2c_read_adapter;
    platform_ops.io_i2c_get_tick = io_i2c_get_tick;
    platform_ops.io_i2c_reload_tick = user_systick_reload_get() + 1;            // 280000 = 1ms
}

int io_i2c_instance_register(struct io_i2c_instance_t *instance)
{
    uint32_t sys_core_clk = 0;
    if(instance == NULL)
    {
        return -1;
    }

    while(loop_list != NULL)
    {
        loop_list = loop_list->next;
    }

    loop_list = instance;

    loop_list->state = IO_I2C_IDLE;
    loop_list->ops_param.ops_state = IO_I2C_OPS_IDLE;
    loop_list->ops_param.reg_addr = 0;
    loop_list->ops_param.data_len = 0;
    loop_list->ops_param.data = NULL;
    loop_list->ops_param.sending_data = 0;
    loop_list->ops_param.sending_bit = 0;
    loop_list->ops_param.sending_bytes = 0;
    loop_list->ops_param.start_tick = 0;
    loop_list->ops_param.exceed_tick = 0;
    sys_core_clk = user_get_system_core_clk();
    /* 100 KHz = 10 us = 2800 ticks, test in 11.5uS */ 
    loop_list->ops_param.delay_tick = sys_core_clk/1000/loop_list->speed/2;


    loop_list->next = NULL;

    platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin, 1);
    platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin, 1);

    return 0;
}

void io_i2c_loop_task(void)
{
    struct io_i2c_instance_t *list = loop_list;

    while(list != NULL)
    {
        switch (list->state) 
        {
            case IO_I2C_IDLE:
                
                break;

            case IO_I2C_READ:
            case IO_I2C_WRITE:
                io_i2c_state_machine(list);
                break;
                
            case IO_I2C_ERROR:
                break;

            default:
                break;
        }

        list = list->next;
    }
}

static int io_i2c_time_exceed(uint32_t *start_time, uint32_t *time_out)
{
    uint32_t temp_tick = platform_ops.io_i2c_get_tick();
    uint32_t esc_tick = 0;
    /* systick is a count down counter */ 
    if(temp_tick < *start_time) 
    {
        esc_tick = *start_time - temp_tick;
    }
    else 
    {
        esc_tick = *start_time + (platform_ops.io_i2c_reload_tick - temp_tick);
    }

    *start_time = temp_tick;
    if(esc_tick >= *time_out)
    {
        *time_out = 0;
    }
    else 
    {
        *time_out -= esc_tick;
    }

    /* return remain time */
    return *time_out;
}

static int io_i2c_state_machine(struct io_i2c_instance_t *instance)
{
    static uint32_t sda_val = 0;
    switch (instance->ops_param.ops_state) 
    {
        /* start signal begin */
        case IO_I2C_OPS_IDLE:
            /* pull up scl and sda prepare for start  */ 
            platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,1);
            platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);
            instance->ops_param.start_tick = platform_ops.io_i2c_get_tick();
            instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
            instance->ops_param.ops_state = IO_I2C_OPS_START_SDA0;
            i2c_printf("IDLE trans to START\r\n");
            break;
        
        case IO_I2C_OPS_START_SDA0:
        case IO_I2C_OPS_SR_SDA0:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,0);
                /* no need get new start tick ,it is updated in io_i2c_time_exceed() */ 
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;   
                
                if(instance->ops_param.ops_state == IO_I2C_OPS_START_SDA0)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_START_SCL0;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_SR_SDA0)
                {
                    i2c_printf("SR sending\r\n");
                    instance->ops_param.ops_state = IO_I2C_OPS_SR_SCL0;
                }
                
            }
            break;

        case IO_I2C_OPS_START_SCL0:
        case IO_I2C_OPS_SR_SCL0:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,0);
                /* no need get new start tick ,it is updated in io_i2c_time_exceed() */ 
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;

                if(instance->ops_param.ops_state  == IO_I2C_OPS_START_SCL0)
                {
                    /* next time send device address MSB */ 
                    /* 7 bits address */ 
                    if(instance->device_addr_mode == 0)
                    {
                        instance->ops_param.sending_data = instance->device_addr;
                        instance->ops_param.sending_bytes = 1;
                    }
                    /* this case IS NOT TESTED */
                    /* 10 bits address  */ 
                    else 
                    {   
                        instance->ops_param.sending_data = (instance->device_addr >> 8);
                        instance->ops_param.sending_bytes = 2;
                    }
                    i2c_printf("Start signal sent, send device address 0x%02X, dev address mode %d\r\n", instance->device_addr, instance->device_addr_mode);
                    instance->ops_param.sending_bit = 8;
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_ADDR_SDA_SET;
                }

                if(instance->ops_param.ops_state  == IO_I2C_OPS_SR_SCL0)
                {
                    /* Read data*/
                    /* 7 bits address */ 
                    if(instance->device_addr_mode == 0)
                    {
                        i2c_printf("Setting 8bit read device address\r\n");
                        instance->ops_param.sending_data = ((instance->device_addr) | 0x01);
                        instance->ops_param.sending_bytes = 1;
                    }
                    else 
                    {
                        i2c_printf("Setting 16bit read device address\r\n");
                        instance->ops_param.sending_data = (((instance->device_addr) >> 8) | 0x01);
                        instance->ops_param.sending_bytes = 2;
                    }
                    instance->ops_param.sending_bit = 8;
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_RADDR_SDA_SET;
                }

