404Zen/STM32H7_Arm2D/Code/app/App/Drivers/io_i2c.c
            }
            break;
        /* start signal end */

        /* device address msb begin and loop  */
        /* reg address begin and loop */
        /* SDA = data， SCL = 0 */
        case IO_I2C_OPS_DEV_ADDR_SDA_SET:
        case IO_I2C_OPS_REG_ADDR_SDA_SET:
        case IO_I2C_OPS_DATA_SDA_SET:
        case IO_I2C_OPS_DEV_RADDR_SDA_SET:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                /* no need get new start tick ,it is updated in io_i2c_time_exceed() */ 
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                /* set sda line according device address */
                if((instance->ops_param.sending_bit)--)
                {
                    sda_val =((instance->ops_param.sending_data & (0x01 << instance->ops_param.sending_bit)) == 0x00) ? 0 : 1;
                    i2c_printf("%d.", sda_val);
                    platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,sda_val);
                    
                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_ADDR_SDA_SET)
                    {   
                        instance->ops_param.ops_state = IO_I2C_OPS_DEV_ADDR_SCL_SET;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_REG_ADDR_SDA_SET)
                    {
                        instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_SCL_SET;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DATA_SDA_SET)
                    {
                        instance->ops_param.ops_state = IO_I2C_OPS_DATA_SCL_SET;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_RADDR_SDA_SET)
                    {
                        instance->ops_param.ops_state = IO_I2C_OPS_DEV_RADDR_SCL_SET;
                    }
                }
                else 
                {
                    /* next is ack, pull up sda and hope device pull it down */
                    platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,1);
                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_ADDR_SDA_SET)
                    {
                        i2c_printf("Device address is set, wait device ack!\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_DEV_ADDR_ACK;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_REG_ADDR_SDA_SET)
                    {
                        i2c_printf("Reg address is set, wait device ack!\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_ACK;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DATA_SDA_SET)
                    {
                        instance->ops_param.ops_state = IO_I2C_OPS_DATA_ACK;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_RADDR_SDA_SET)
                    {
                        i2c_printf("Read device address is set, wait device ack!\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_DEV_RADDR_ACK;
                    }
                }

            }
            break;

        /* SDA = data， SCL = 1, data vaild time set */
        case IO_I2C_OPS_DEV_ADDR_SCL_SET:
        case IO_I2C_OPS_REG_ADDR_SCL_SET:
        case IO_I2C_OPS_DATA_SCL_SET:
        case IO_I2C_OPS_DEV_RADDR_SCL_SET:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                /* no need get new start tick ,it is updated in io_i2c_time_exceed() */ 
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);

                if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_ADDR_SCL_SET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_ADDR_SCL_RESET;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_REG_ADDR_SCL_SET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_SCL_RESET;
                }
                
                if(instance->ops_param.ops_state == IO_I2C_OPS_DATA_SCL_SET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DATA_SCL_RESET;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_RADDR_SCL_SET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_RADDR_SCL_RESET;
                }
            }
            break;
        
        /* SDA = data， SCL = 1->0, go to prepare next data */
        case IO_I2C_OPS_DEV_ADDR_SCL_RESET:
        case IO_I2C_OPS_REG_ADDR_SCL_RESET:
        case IO_I2C_OPS_DATA_SCL_RESET:
        case IO_I2C_OPS_DEV_RADDR_SCL_RESET:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                /* no need get new start tick ,it is updated in io_i2c_time_exceed() */ 
                instance->ops_param.exceed_tick = 0;
                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,0);

                if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_ADDR_SCL_RESET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_ADDR_SDA_SET;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_REG_ADDR_SCL_RESET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_SDA_SET;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_DATA_SCL_RESET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DATA_SDA_SET;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_RADDR_SCL_RESET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_RADDR_SDA_SET;
                }
            }
            break;

