404Zen/STM32H7_Arm2D/Code/app/App/Drivers/io_i2c.c
        /* SDA = 1, SCL = 0->1, gen clock for ack */
        case IO_I2C_OPS_DEV_ADDR_ACK:
        case IO_I2C_OPS_REG_ADDR_ACK:
        case IO_I2C_OPS_DATA_ACK:
        case IO_I2C_OPS_DEV_RADDR_ACK:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                /* no need get new start tick ,it is updated in io_i2c_time_exceed() */ 
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);

                if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_ADDR_ACK)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_ADDR_ACK_READ;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_REG_ADDR_ACK)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_ACK_READ;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_RADDR_ACK)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_RADDR_ACK_READ;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_DATA_ACK)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_DATA_ACK_READ;
                }
            }
            break;

        /* sda = ack, scl = 1->0, read ack and the pull down scl */
        case IO_I2C_OPS_DEV_ADDR_ACK_READ:
        case IO_I2C_OPS_REG_ADDR_ACK_READ:
        case IO_I2C_OPS_DEV_RADDR_ACK_READ:
        case IO_I2C_OPS_DATA_ACK_READ:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                /* no need get new start tick ,it is updated in io_i2c_time_exceed() */ 
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;

                if(platform_ops.io_i2c_pin_read(instance->sda_port, instance->sda_pin) != 0)
                {
                    /* device no ack */
                    i2c_printf("ack failed, last state is %d\r\n", instance->ops_param.ops_state);
                    instance->ops_param.ops_state = IO_I2C_OPS_DEV_ACK_FAILED;
                }
                else 
                {
                    /* device ack */
                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_ADDR_ACK_READ)
                    {   
                        i2c_printf("dev address ack ok\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_DEV_ADDR_ACK_OK;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_REG_ADDR_ACK_READ)
                    {   
                        i2c_printf("reg address ack ok\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_ACK_OK;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_RADDR_ACK_READ)
                    {   
                        i2c_printf("read device address ack ok\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_DEV_RADDR_ACK_OK;
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DATA_ACK_READ)
                    {   
                        i2c_printf("write data ack ok\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_DATA_ACK_OK;
                    }
                }

                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,0);
            }
            break;

        /* SDA = 1， SCL = 0 */
        case IO_I2C_OPS_DEV_ADDR_ACK_OK:
        case IO_I2C_OPS_REG_ADDR_ACK_OK:
        case IO_I2C_OPS_DEV_RADDR_ACK_OK:
        case IO_I2C_OPS_DATA_ACK_OK:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                /* no need get new start tick ,it is updated in io_i2c_time_exceed() */ 
                instance->ops_param.exceed_tick = 0;
                instance->ops_param.sending_bytes--;

                /* data unfinished in this phase */
                if(instance->ops_param.sending_bytes)
                {
                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_ADDR_ACK_OK)
                    {
                        instance->ops_param.sending_data = instance->device_addr & 0xFF;
                        instance->ops_param.sending_bit = 8;
                        instance->ops_param.ops_state = IO_I2C_OPS_DEV_ADDR_SDA_SET;
                        i2c_printf("device address ack ok, setting next 8bit address\r\n");
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_REG_ADDR_ACK_OK)
                    {
                        instance->ops_param.sending_data = (instance->ops_param.reg_addr & 0xFF);
                        instance->ops_param.sending_bit = 8;
                        instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_SDA_SET;
                        i2c_printf("reg addr ack ok, sending next 8bit address\r\n");
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_RADDR_ACK_OK)
                    {
                        /* sda = x scl = 0 and time is delayed */
                        instance->ops_param.sending_data = instance->device_addr & 0xFF;
                        instance->ops_param.sending_bit = 8;
                        instance->ops_param.ops_state = IO_I2C_OPS_DEV_RADDR_SDA_SET;
                        i2c_printf("first 8bit of 16bit read device address set ok\r\n");
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DATA_ACK_OK)
                    {
                        instance->ops_param.data++;
                        instance->ops_param.sending_data = *(instance->ops_param.data);
                        instance->ops_param.sending_bit = 8;
                        instance->ops_param.ops_state = IO_I2C_OPS_DATA_SDA_SET;
                        i2c_printf("write data ack ok, sending next data byte\r\n");
                    }
                }
                else 
                {
                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_ADDR_ACK_OK)
                    {
                        i2c_printf("device address set done!\r\n");
                        /* device address finished , send reg address */
                        instance->ops_param.sending_bytes = instance->reg_address_bytes;
                        if(instance->ops_param.sending_bytes == 1)
                        {
                            /* reg address is 8 bit*/
                            instance->ops_param.sending_data = (instance->ops_param.reg_addr & 0xFF);
                            instance->ops_param.sending_bit = 8;
                            instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_SDA_SET;

                            i2c_printf("set 8bit reg address 0x%02X\r\n", instance->ops_param.sending_data);
                        }
                        else if(instance->ops_param.sending_bytes == 2)
                        {
                            /* reg address is 16 bit*/
                            instance->ops_param.sending_data = (instance->ops_param.reg_addr >> 8);
                            instance->ops_param.sending_bit = 8;
                            instance->ops_param.ops_state = IO_I2C_OPS_REG_ADDR_SDA_SET;

                            i2c_printf("set 16bit reg address 0x%04X 1/2 \r\n", instance->ops_param.reg_addr);
                        }
                        else 
                        {
                            instance->ops_param.ops_state = IO_I2C_OPS_REG_ERROR;
                        }
                    }
                    
