404Zen/STM32H7_Arm2D/Code/app/App/Drivers/io_i2c.c
                    /* reg address send done*/
                    if(instance->ops_param.ops_state == IO_I2C_OPS_REG_ADDR_ACK_OK)
                    {
                        /* reg address finished, send sr or write data */
                        if(instance->state == IO_I2C_READ)
                        {
                            // sr
                            instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                            platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,1);
                            platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);

                            instance->ops_param.ops_state = IO_I2C_OPS_SR_SDA0;

                            i2c_printf("Reg address set ok, READ data, next is SR\r\n");
                        }
                        else if(instance->state == IO_I2C_WRITE)
                        {
                            // write data
                            instance->ops_param.sending_bytes = instance->ops_param.data_len;
                            instance->ops_param.sending_data = *(instance->ops_param.data);
                            instance->ops_param.sending_bit = 8;
                            instance->ops_param.ops_state = IO_I2C_OPS_DATA_SDA_SET;
                            i2c_printf("Reg address set ok, WRITE data, next is DATA\r\n");
                        }
                    }

                    /* read cmd is ok, ready to read data */
                    if(instance->ops_param.ops_state == IO_I2C_OPS_DEV_RADDR_ACK_OK)
                    {
                        /* read data */
                        if(instance->state == IO_I2C_READ)
                        {
                            /* sda = x scl = 0 and time is delayed */
                            instance->ops_param.sending_bytes = instance->ops_param.data_len;
                            instance->ops_param.sending_data = 0;
                            instance->ops_param.sending_bit = 8;

                            instance->ops_param.ops_state = IO_I2C_OPS_READ_SCL_SET;

                            i2c_printf("Ready to read data %d * %d bits.\r\n", instance->ops_param.sending_bytes, instance->ops_param.sending_bit);
                        }
                        else 
                        {
                            /* should never run here */
                            instance->ops_param.ops_state = IO_I2C_OPS_ERROR;
                        }
                    }

                    if(instance->ops_param.ops_state == IO_I2C_OPS_DATA_ACK_OK)
                    {
                        /* write data finished, send stop signal */
                        instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                        platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,0);
                        platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);

                        instance->ops_param.ops_state = IO_I2C_OPS_SEND_STOP;

                        i2c_printf("Write data finished, next is STOP\r\n");
                    }
                }
            }
            break;

        case IO_I2C_OPS_READ_SCL_SET:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);
                
                instance->ops_param.ops_state = IO_I2C_OPS_READ_SDA_GET;
            }
            break;

        case IO_I2C_OPS_READ_SDA_GET:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                instance->ops_param.sending_data <<= 1;
                sda_val = (platform_ops.io_i2c_pin_read(instance->sda_port, instance->sda_pin) == 0x00) ? 0x00 : 0x01;
                instance->ops_param.sending_data |= sda_val;

                i2c_printf("%d.", sda_val);

                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,0);
                instance->ops_param.sending_bit--;

                if(instance->ops_param.sending_bit)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_READ_SCL_SET;
                }
                else 
                {
                    *(instance->ops_param.data) = instance->ops_param.sending_data;
                    instance->ops_param.data++;                     /* move pointer */
                    instance->ops_param.sending_data = 0x00;
                    instance->ops_param.sending_bytes--;
                    if(instance->ops_param.sending_bytes)
                    {
                        /* send ack */
                        i2c_printf("read not finish, send ack\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_SEND_ACK;
                    }
                    else 
                    {
                        /* send nack */
                        i2c_printf("read finished, send nack\r\n");
                        instance->ops_param.ops_state = IO_I2C_OPS_SEND_NACK;
                    }
                }
            }
            break;

        case IO_I2C_OPS_SEND_ACK:
        case IO_I2C_OPS_SEND_NACK:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;

                if(instance->ops_param.ops_state == IO_I2C_OPS_SEND_ACK)
                {
                    platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,0);
                    instance->ops_param.ops_state = IO_I2C_OPS_SEND_ACK_SCL_SET;
                }

