404Zen/STM32H7_Arm2D/Code/app/App/Drivers/io_i2c.c
                if(instance->ops_param.ops_state == IO_I2C_OPS_SEND_NACK)
                {
                    platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,1);
                    instance->ops_param.ops_state = IO_I2C_OPS_SEND_NACK_SCL_SET;
                }
                
            }
            break;

        case IO_I2C_OPS_SEND_ACK_SCL_SET:
        case IO_I2C_OPS_SEND_NACK_SCL_SET:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;

                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);

                if(instance->ops_param.ops_state == IO_I2C_OPS_SEND_ACK_SCL_SET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_SEND_ACK_BUS_RELEASE;
                }
                
                if(instance->ops_param.ops_state == IO_I2C_OPS_SEND_NACK_SCL_SET)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_SEND_NACK_BUS_RELEASE;
                }
            }
            break;

        case IO_I2C_OPS_SEND_ACK_BUS_RELEASE:
        case IO_I2C_OPS_SEND_NACK_BUS_RELEASE:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;

                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,0);

                if(instance->ops_param.ops_state == IO_I2C_OPS_SEND_ACK_BUS_RELEASE)
                {
                    platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,1);
                    instance->ops_param.ops_state = IO_I2C_OPS_SEND_ACK_DONE;
                }
                
                if(instance->ops_param.ops_state == IO_I2C_OPS_SEND_NACK_BUS_RELEASE)
                {
                    instance->ops_param.ops_state = IO_I2C_OPS_SEND_NACK_DONE;
                }
                
            }
            break;

        case IO_I2C_OPS_SEND_ACK_DONE:
        case IO_I2C_OPS_SEND_NACK_DONE:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                if(instance->ops_param.ops_state == IO_I2C_OPS_SEND_ACK_DONE)
                {
                    instance->ops_param.exceed_tick = 0;
                    instance->ops_param.sending_bit = 8;
                    // ack done, read next data 
                    instance->ops_param.ops_state = IO_I2C_OPS_READ_SCL_SET;
                }

                if(instance->ops_param.ops_state == IO_I2C_OPS_SEND_NACK_DONE)
                {
                    instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                    i2c_printf("Send STOP\r\n");
                    instance->ops_param.ops_state = IO_I2C_OPS_SEND_STOP;
                }
            }
            break;

        case IO_I2C_OPS_SEND_STOP:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,0);

                instance->ops_param.ops_state = IO_I2C_OPS_SEND_STOP_SCL_SET;
            }
            break;

        case IO_I2C_OPS_SEND_STOP_SCL_SET:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);

                instance->ops_param.ops_state = IO_I2C_OPS_SEND_STOP_SDA_SET;
            }
            break;

        case IO_I2C_OPS_SEND_STOP_SDA_SET:
            if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                instance->ops_param.exceed_tick = instance->ops_param.delay_tick;
                platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,1);

                instance->ops_param.ops_state = IO_I2C_OPS_IDLE;
                instance->state = IO_I2C_IDLE;

                // transmit done call back
                if(instance->callback != NULL)
                {
                    instance->callback(0);
                }
            }
            break;
            break;


        /* Fall through all error */
        case IO_I2C_OPS_DEV_ACK_FAILED:
        case IO_I2C_OPS_REG_ERROR:
        case IO_I2C_OPS_ERROR:
        default:
            // if(io_i2c_time_exceed(&(instance->ops_param.start_tick), &(instance->ops_param.exceed_tick)) == 0)
            {
                // instance->ops_param.start_tick = 0;
                // instance->ops_param.exceed_tick = 0;
                // instance->ops_param.sending_data = 0;
                // instance->ops_param.sending_bit = 0;
                platform_ops.io_i2c_pin_write(instance->sda_port, instance->sda_pin,1);
                platform_ops.io_i2c_pin_write(instance->scl_port, instance->scl_pin,1);
                i2c_printf("ERROR, last state is %d\r\n", instance->ops_param.ops_state);
                instance->state = IO_I2C_ERROR;
                instance->callback(instance->ops_param.ops_state);
            }
            break;
    }

    return 0;
}

int io_i2c_write_reg(struct io_i2c_instance_t *instance, uint16_t reg_addr, uint16_t len, uint8_t *data)
{
    if(instance == NULL)
    {
        return -1;
    }
    else 
    {
        if(instance->state != IO_I2C_IDLE)
        {
            return -2;
        }
        else 
        {
            instance->state = IO_I2C_WRITE;
            instance->ops_param.reg_addr = reg_addr;
            instance->ops_param.data_len = len;
            instance->ops_param.data = data;

