404Zen/STM32H7_Arm2D/Code/app/App/Drivers/io_i2c.c
            return 0;
        }
    }
    return 0;
}

int io_i2c_read_reg(struct io_i2c_instance_t *instance, uint16_t reg_addr, uint16_t len, uint8_t *data)
{


    if(instance == NULL)
    {
        return -1;
    }
    else 
    {
        if(instance->state != IO_I2C_IDLE)
        {
            return -2;
        }
        else 
        {
            instance->state = IO_I2C_READ;
            instance->ops_param.reg_addr = reg_addr;
            instance->ops_param.data_len = len;
            instance->ops_param.data = data;

            return 0;
        }
    }

    return -100;
}

// static void io_i2c_start(io_i2c_instance_t *instance)
// {

// }

static uint32_t i2c_test_start = 0;
static uint32_t i2c_test_left = 0; // platform_ops.io_i2c_reload_tick * 500;
uint8_t touch_id[11] = {0};

void io_i2c_test(void)
{
    /* Should be 0x39 0x31 0x31 0x00 0x60 0x10 0x20 0x20 0x03 0xE0 0x01 */
    io_i2c_read_reg(&touch_i2c, 0x8140, 11, touch_id);

    HAL_Delay(100);
#if 0
    if(io_i2c_time_exceed(&i2c_test_start, &i2c_test_left) == 0) 
    {

   
        i2c_test_start = platform_ops.io_i2c_get_tick();
        i2c_test_left = platform_ops.io_i2c_reload_tick * 100;

        val = !val;
        platform_ops.io_i2c_pin_write(instance.sda_port, instance.sda_pin,val);
        platform_ops.io_i2c_pin_write(instance.scl_port, instance.scl_pin,val);
    
        return;
    }
#endif
}

void test_callback(uint8_t event)
{
    static uint8_t test_val = 0;

    if(event == 0)
    {
        test_val = 0;
    }

    if(event == 1)
    {
        test_val++;
    }
}
